[
    {
        "definition": "This is the main Platform.sh configuration file, it allows you to configure the stack you are using as well as build and deploy and runtime dependencies and hooks.",
        "title": ".platform.app.yaml"
    },
    {
        "definition": "Platform.sh provides a REST API (Application Programming Interface) which allows you to interact whith it. Both the Platform UI and the Platform CLI are fully integrated with the Platform API.",
        "title": "API"
    },
    {
        "definition": "Your application regroups all your code and configuration files that you want to deploy.",
        "title": "Application"
    },
    {
        "definition": "A versioned copy of your Git content. A branch is used to develop a specific feature and test an update, before it is synchronize and deployed on the live environment. Platform.sh extends the concept of a Git branch to the environment level.",
        "title": "Branch"
    },
    {
        "definition": "Commerce Kickstart is the quickest way to get up and running with Drupal Commerce.",
        "title": "Commerce Kickstart"
    },
    {
        "definition": "Those files are stored in Git and allow you to easily interact with Platform topology and routes.",
        "title": "Configuration files"
    },
    {
        "definition": "CLI Command Line Interface The official tool to use and manage your Platform projects directly from within your terminal. Anything you can do in the Platform UI, you can do in your terminal with Platform CLI.",
        "title": "Container"
    },
    {
        "definition": "Allows you to run various actions during the deployment of your environment.",
        "title": "Deployment hooks"
    },
    {
        "definition": "Domain names are managed by Registrars (such as Namecheap.com) and you are responsible for using appropriate DNS tools for pointing domains to your Platform.sh Master environment.",
        "title": "Domain name"
    },
    {
        "definition": "A powerful open source software package that allows you to easily organize, manage, and publish your content with an endless variety of customization (see <https://drupal.org/drupal-7.0< for more information).",
        "title": "Drupal "
    },
    {
        "definition": "A no-assumption, first-of-a-kind framework that can power the most demanding ecommerce projects. (see <https://drupal.org/project/commerce< for more information).",
        "title": "Drupal Commerce"
    },
    {
        "definition": "Drush is a command-line shell and scripting interface for Drupal.",
        "title": "Drush"
    },
    {
        "definition": "Drush aliases allow you to run a drush commands on your local server but actually execute the command on a remote server.",
        "title": "Drush aliases"
    },
    {
        "definition": "An environment is a Git branch, plus all the services service which are serving that branch.",
        "title": "Environment"
    },
    {
        "definition": "An environment which is deployed. You can deactivate an active environment from the environment configuration page on Platform UI.",
        "title": "Active Environment "
    },
    {
        "definition": "An environment which is not deployed. You can activate an inactive environment from the environment configuration page on Platform UI.",
        "title": "Inactive environment"
    },
    {
        "definition": "Variables exposed by Platform to the runtime environment which allow you to define any specific configuration at the environment level.",
        "title": "Environment variables"
    },
    {
        "definition": "An open source version control system. Also see git.",
        "title": "Git"
    },
    {
        "definition": "A process by which we make stuff",
        "title": "Make"
    },
    {
        "definition": "A file used in comination with Drupal and Drush  to download a series of modules, libraries, and repositories. Also see drush make files.",
        "title": "Make file"
    },
    {
        "definition": "The production website. Master is the only environment which doesn’t have a parent and which has the most of the resources that you can get.",
        "title": "Master"
    },
    {
        "definition": "The act of combining one environment's or branch's code with another.",
        "title": "Merge"
    },
    {
        "definition": "Platform.sh provides an organized hierarchy for your Git branches. Each environment has a parent and can have multiple children. You can merge code to a parent environment, and synchronize code and/or data to any child environment.",
        "title": "Parent"
    },
    {
        "definition": "Platform CLI is the official command line shell and Unix scripting interface for Platform. It ships with all the useful commands to interact with your Platform projects. You can get download it [here](https://github.com/commerceguys/platform-cli).",
        "title": "Platform CLI "
    },
    {
        "definition": "A subscription level which allows you to host your production website by adding a domain and an SSL certificate.",
        "title": "Production plan"
    },
    {
        "definition": "A Platform account that consists of a specific set of environments, users, size, and storage.",
        "title": "Project"
    },
    {
        "definition": "The act of combining code from a remote branch to a local branch.",
        "title": "Pull"
    },
    {
        "definition": "The act of moving and combining code from a local branch to a remote branch. Relationship Relationships The relationships of the application with services or other applications. See also relationships.",
        "title": "Push"
    },
    {
        "definition": "A route describes how an incoming URL is going to be processed by Platform.sh to serve a project. See also routes configuration.",
        "title": "Routes"
    },
    {
        "definition": "A web technology utilized as part of a server setup and/or configuration. See also service grid",
        "title": "Service"
    },
    {
        "definition": "A server setup that allows seperate functionality and scale of services as needed. See also service grid.",
        "title": "Service Grid"
    },
    {
        "definition": "A short-term initiative or release in an agile development cycle.",
        "title": "Sprint"
    },
    {
        "definition": "A cryptographic network protocol for secure data communication, remote command-line login, remote command execution, and other sercure network services between two networked computers. See also ssh.",
        "title": "SSH"
    },
    {
        "definition": "A means to identify yourself to an SSH server securely.",
        "title": "SSH Key"
    },
    {
        "title": "SSL Certificate A certificate used to serve and secure your site."
    },
    {
        "definition": "Symfony is a PHP web application framework for MVC applications. Symfony is free software and released under the MIT license (see http://symfony.com/ more information).",
        "title": "Symfony"
    },
    {
        "definition": "The act of updating an environment with code and data from a parent environment.",
        "title": "Sync"
    },
    {
        "definition": "A specific set of tools that you're project is built with. It can be a CMS (Drupal), a framework (Symfony)...",
        "title": "Toolstack"
    }
]
